---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForHooksEnabled
source: html/e7fa15c3-dfd8-9be3-6702-5e07b424035b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForHooksEnabled Property

"Hook Bends"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForHooksEnabled { get; }
```